rocksdb/experiments/M2/results/20260429-020219/budget_on/run_2/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 02:05:26 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777428326822218 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       9.042 micros/op 110590 ops/sec 45.212 seconds 5000000 operations;  109.7 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      14.063 micros/op 71110 ops/sec 70.313 seconds 5000000 operations;   70.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       9.575 micros/op 104432 ops/sec 47.878 seconds 5000000 operations;  103.6 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     15/0   934.32 MB   3.8      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    522.6     28.60             23.27       240    0.119       0      0       0.0       0.0
  L1     15/1   1006.34 MB   3.7     25.5    13.7     11.9      22.3     10.4       0.0   1.6    266.4    232.6     98.16             85.18        18    5.454     25M  3296K       0.0       0.0
  L2     97/3    4.52 GB   1.8     19.8     8.9     10.9      14.8      4.0       0.6   1.7    327.6    245.7     61.76             52.13       131    0.471     20M  5024K       0.0       0.0
 Sum    127/4    6.42 GB   0.0     45.3    22.6     22.7      51.7     29.0       0.6   3.5    246.0    280.9    188.53            160.59       389    0.485     46M  8320K       0.0       0.0
 Int      0/0    0.00 KB   0.0     45.1    22.3     22.7      51.1     28.3       0.6   3.6    246.8    279.7    186.90            159.20       381    0.491     45M  8316K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     45.3    22.6     22.7      37.1     14.4       0.0   0.0    290.0    237.7    159.93            137.32       149    1.073     46M  8320K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    522.6     28.60             23.27       240    0.119       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 163.4 total, 160.4 interval
Flush(GB): cumulative 14.598, interval 14.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 51.72 GB write, 324.06 MB/s write, 45.30 GB read, 283.83 MB/s read, 188.5 seconds
Interval compaction: 51.05 GB write, 325.90 MB/s write, 45.05 GB read, 287.61 MB/s read, 186.9 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 20, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 26, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 26, total-stops: 0
interval: 26 total count
Block cache LRUCache@0x5592ba6eedf0#75413 capacity: 32.00 MB seed: 1208529226 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000142 secs_since: 163
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 163.4 total, 160.4 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 92.44 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 92.44 MB/s
Cumulative stall: 00:01:3.792 H:M:S, 39.0 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14632.71 MB, 91.22 MB/s
Interval WAL: 14M writes, 0 syncs, 14529843.00 writes per sync, written: 14.29 GB, 91.22 MB/s
Interval stall: 00:01:3.792 H:M:S, 39.8 percent
Write Stall (count): write-buffer-manager-limit-stops: 0